export const defaultSubs = [
  '仕事',
  'ソフトウェア',
  '英語',
  '筋トレ',
  '健康',
  '心のケア',
  '家族',
  '暮らしと習慣'
];

export const defaultDetails = [
  // 仕事
  [ '将来ビジョン', 'アイデア', '領域拡大', '提案力', '素直に聞く', 'コミュ力', '興味を持つ', 'やりがい創出' ],
  // ソフトウェア
  [ '個人アプリ10本デプロイ', 'AWS CLF合格', 'AWS SAA合格', 'AI活用', 'ポートフォリオ', 'マーケティング', '発信力強化', 'SEO' ],
  // 英語
  [ 'TOEIC800点', '金フレ', '公式問題集', 'Abceed', '出る1000', 'SNS英語投稿', 'シャドーイング', '英会話レッスン' ],
  // 筋トレ
  [ '週3筋ジム', 'ベンチ90kg', '筋肉量管理', 'プロテイン', 'シックスパック', 'クレアチン', '細マッチョ', '学習' ],
  // 健康
  [ '体脂肪12%', '体重65kg', 'ストレッチ', 'ヘルシーオイル', 'スムージー', '睡眠8時間', 'サプリ摂取', 'ラーメン週2まで' ],
  // 心のケア（自己肯定感）
  [ '自分を褒める', '対等な目線', '比較しない', '感謝を言葉に', 'ネガティブ認知', '脱・完璧主義', 'ポジティブ', '瞑想' ],
  // 家族
  [ 'ランドセル購入', '家族時間', '年2回旅行', '習い事', '穏やかに接する', '家族写真', '記念日を祝う', 'こどもとの対話' ],
  // 暮らしと習慣（生活 + 美容）
  [ 'ファッション', 'アクセサリー', '国内旅行', '海外旅行', 'スマホ見過ぎない', '友達・同僚と会話', '美容ケア', '節酒' ]
]; 